package com.util;

import org.junit.Test;

import java.util.Base64;

/**
 * @Auther: huangzhigao
 * @Date: 2020/7/8
 * @Description:
 */
public class CommonUtils {
    public static String base64Decode(String string) {
        byte[] bytes = Base64.getDecoder().decode(string);
        return new String(bytes);
    }

    public static long covertTimeToLong(long value) {
        int curLen = String.valueOf(value).length();
        int overLen = curLen - 13;
        if (0 == overLen) {
            return value;
        } else if (overLen > 0) {
            return (value / new Double(Math.pow(10, overLen)).longValue());
        } else {
            return (value * new Double(Math.pow(10, overLen)).longValue());
        }
    }

    public static String[] generatorPeopleName() {
        String value = "师明艳石月杉充怡璐瞿春雪符晶辉聂恩霈蒙桂芳傅苏凌吴凝海邹蕴和瞿秋芸郏芬璇黄忆安卓冬菱弓瓶花胡敏丽寇瑶岑黄听白乜牧歌景友梅戈悦心赖妮娜邹荌荌傅朝旭茹梅雪幸雅逸牧奥雅余悦远弘听蓉勾杰文冉听莲孔苏夏郜南春勾素洁宁舒岚印柏文储梓敏简代丝能凝琴宰夏岚阚燕珺蒙心香羿音华桓歌阑公如天薛梓颖焦忆柏廖幻波寇彭丹须晶茹郝媛雪隆幼珊宓幻柏麴芃芃于书云常佩玉伊怜珊戈忆南武若彤梁向晨苍悠柔龙家美许婷美庾从筠越献玉养书怡宓寄凡蒲绮美朱宛凝车恨松厉林娜莘舒扬阚修敏桂灵仙浦冰珍权昱文金碧琳贺夜蕾印杉月融敏慧弓念波家紫菱丁香芹曹雁卉双妙旋桂庭酪桂晓巧麴羽洁冷米莱宁思洁从睿彤冯琼思堵雅娴简问香广怀亦乔湉湉晃香桃满华婉祖妙竹谭涵菡";
        String[] names = new String[100];
        for (int i = 0; i < 300; i = i + 3) {
            try {
                names[i / 3] = value.substring(i, i + 3);
            } catch (Exception e) {
                break;
            }

        }
        return names;
    }

    public static String[] generatorAddress() {
        String values = "河北省秦皇岛市,河北省邢台市,河北省承德市,河北省沧州市,\n" +
                "河北省廊坊市,河北省衡水市,山西省阳泉市,山西省长治市,\n" +
                "内蒙乌海市,内蒙赤峰市,辽宁省营口市,辽宁省盘锦市,\n" +
                "辽宁省铁岭市,辽宁省朝阳市,辽宁省葫芦岛市,吉林省四平市,\n" +
                "吉林省辽源市,吉林省通化市,吉林省白山市,吉林省松原市,\n" +
                "吉林省白城市,黑龙江省双鸭山市,黑龙江省七台河市,江苏省南通市,\n" +
                "江苏省连云港市,江苏省淮阴市,江苏省盐城市,江苏省扬州市,\n" +
                "江苏省镇江市,江苏省泰州市,浙江省温州市,浙江省嘉兴市,\n" +
                "浙江省湖州市,浙江省绍兴市,浙江省台州市,安徽省芜湖市,\n" +
                "安徽省蚌埠市,安徽省马鞍山市,安徽省铜陵市,安徽省安庆市,\n" +
                "安徽省阜阳市,福建省泉州市,福建省漳州市,福建省南平市,\n" +
                "福建省龙岩市,江西省景德镇市,江西省萍乡市,江西省九江市,\n" +
                "江西省新余市,山东省东营市,山东省济宁市,山东省威海市,\n" +
                "山东省日照市,山东省莱芜市,山东省德州市,河南省鹤壁市";
        return values.split(",");
    }


    public static String[] generatorTrainsCode() {
        String value = "CRH1,D4092,D3032,D321,D2131,CRH3,CRH5,NDJ3,DDJ1,X2000";
        return value.split(",");
    }


    public static String[] generatorIdCard() {
        String value = "110101199003074792,\n" +
                "11010119900307117X,\n" +
                "110101199003070679,\n" +
                "110101199003077432,\n" +
                "110101199003077272,\n" +
                "110101199003072914,\n" +
                "110101199003073714,\n" +
                "110101199003077272,\n" +
                "110101199003075058,\n" +
                "110101199003072535,\n" +
                "110101199003077133,\n" +
                "110101199003074477,\n" +
                "110101199003073976,\n" +
                "110101199003070193,\n" +
                "11010119900307133X,\n" +
                "110101199003075912,\n" +
                "110101199003073490,\n" +
                "110101199003078750,\n" +
                "110101199003079753,\n" +
                "110101199003075453,\n" +
                "11010119900307889X,\n" +
                "110101199003073837,\n" +
                "110101199003077811,\n" +
                "110101199003079913,\n" +
                "110101199003075074,\n" +
                "110101199003071073,\n" +
                "110101199003074215,\n" +
                "110101199003074610,\n" +
                "110101199003073810,\n" +
                "110101199003076552,\n" +
                "110101199003070257,\n" +
                "110101199003078611,\n" +
                "110101199003077715,\n" +
                "110101199003070919,\n" +
                "110101199003076034,\n" +
                "110101199003074995,\n" +
                "110101199003073810,\n" +
                "110101199003079737,\n" +
                "110101199003072295,\n" +
                "110101199003078857,\n" +
                "110101199003072279,\n" +
                "110101199003079390,\n" +
                "110101199003073335,\n" +
                "110101199003076237,\n" +
                "110101199003079577,\n" +
                "110101199003074637,\n" +
                "110101199003072172,\n" +
                "110101199003073079,\n" +
                "110101199003073394,\n" +
                "110101199003071911,\n" +
                "110101199003078515,\n" +
                "110101199003072295,\n" +
                "110101199003075736,\n" +
                "110101199003076333,\n" +
                "110101199003072236,\n" +
                "110101199003070812,\n" +
                "110101199003077395,\n" +
                "110101199003076413,\n" +
                "110101199003075410,\n" +
                "110101199003071233,\n" +
                "110101199003072973,\n" +
                "110101199003075656,\n" +
                "110101199003079817,\n" +
                "110101199003070695,\n" +
                "110101199003076536,\n" +
                "110101199003075859,\n" +
                "110101199003075699,\n" +
                "110101199003070353,\n" +
                "110101199003075592,\n" +
                "110101199003077950,\n" +
                "110101199003079198,\n" +
                "110101199003077870,\n" +
                "110101199003077379,\n" +
                "110101199003072535,\n" +
                "110101199003074119,\n" +
                "110101199003076958,\n" +
                "11010119900307715X,\n" +
                "11010119900307627X,\n" +
                "110101199003070038,\n" +
                "110101199003070556,\n" +
                "110101199003078195,\n" +
                "110101199003078531,\n" +
                "110101199003072834,\n" +
                "110101199003073933,\n" +
                "110101199003074872,\n" +
                "110101199003075058,\n" +
                "110101199003074733,\n" +
                "110101199003072279,\n" +
                "110101199003071479";
        String[] split = value.split(",");
        return split;
    }

    public static void main(String[] args) {
        System.out.println();
//        System.out.println(covertTimeToLong(15946050643940L));
//
//        System.out.println(Math.pow(10, 3));
    }


    @Test
    public void test() {
        String str = "INSERT INTO `shsjyj_jyxj` VALUES ('清华大学', '大一', '115班', null, '2001', '农村', '1981', '男', '汉', '党员', '厦门', '78', '健康', '厦门', '福建', '2020-12-16 11:21:54', 'wkahftvx', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('西安电子科技大学', '大二', '114班', '\\n110101199003077298', '2002', '城市', '1982', '女', '汉', '党员', '上海', '79', '良好', '上海', '上海', '2020-12-16 11:21:54', 'vwgdme0s', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('浙江大学', '大三', '117班', '\\n110101199003072391', '2003', '农村', '1983', '男', '汉', '党员', '杭州', '80', '感冒', '杭州', '浙江', '2020-12-16 11:21:54', 'tbp3m3yw', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('武汉大学', '大四', '118班', '\\n110101199003074178', '2004', '城市', '1984', '女', '汉', '党员', '苏州', '81', '虚弱', '苏州', '湖南', '2020-12-16 11:21:54', 'a2ov8uyz', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('西安电子科技', '大一', '119班', '\\n11010119900307491X', '2005', '农村', '1979', '男', '汉', '党员', '无锡', '82', '健康', '无锡', '广东', '2020-12-16 11:21:54', 'd5x8u5do', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('华东政法', '大三', '115班', '\\n11010119900307053X', '2001', '城市', '1978', '女', '汉', '党员', '深圳', '83', '良好', '深圳', '福建', '2020-12-16 11:21:54', 'fx9d2do3', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('武汉大学', '大三', '116班', '\\n110101199003074557', '2002', '农村', '1981', '男', '汉', '党员', '长沙', '85', '感冒', '长沙', '上海', '2020-12-16 11:21:54', 'jqdxohig', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('上海复旦', '大四', '117班', '\\n11010119900307125X', '2003', '城市', '1982', '女', '汉', '党员', '厦门', '78', '虚弱', '厦门', '浙江', '2020-12-16 11:21:54', 'ktgqaqjb', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('南京大学', '大一', '118班', '\\n110101199003070417', '2004', '农村', '1983', '男', '汉', '党员', '上海', '79', '健康', '上海', '湖南', '2020-12-16 11:21:54', 'uv7g8dsa', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('同济大学', '大二', '119班', null, '2005', '城市', '1984', '女', '汉', '党员', '杭州', '80', '良好', '杭州', '广东', '2020-12-16 11:21:54', 'q1lqwsjo', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('南京邮电', '大三', '115班', '\\n110101199003078056', '2001', '农村', '1979', '男', '汉', '党员', '苏州', '81', '感冒', '苏州', '福建', '2020-12-16 11:21:54', 'apxefwpt', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('华北理工大学', '大四', '116班', '\\n110101199003079657', '2002', '城市', '1978', '女', '汉', '党员', '无锡', '82', '虚弱', '无锡', '上海', '2020-12-16 11:21:54', '2o0wyzt1', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('上海中医药大', '大一', '117班', '\\n110101199003078419', '2003', '农村', '1981', '男', '汉', '党员', '深圳', '83', '健康', '深圳', '浙江', '2020-12-16 11:21:54', 'cfrj8i6g', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('上海大学', '大二', '118班', '\\n110101199003072797', '2004', '城市', '1982', '女', '汉', '党员', '长沙', '85', '良好', '长沙', '湖南', '2020-12-16 11:21:54', 'r4ujsi65', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('华东政法大学', '大三', '119班', '\\n110101199003074936', '2005', '农村', '1983', '男', '汉', '党员', '厦门', '78', '感冒', '厦门', '广东', '2020-12-16 11:21:54', 'zfurugp5', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('山东大学', '大四', '115班', '\\n110101199003075613', '2001', '城市', '1984', '女', '汉', '党员', '上海', '79', '虚弱', '上海', '福建', '2020-12-16 11:21:54', 'u3yoqnef', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('北京大学', '大一', '116班', '\\n110101199003078478', '2002', '农村', '1979', '男', '汉', '党员', '杭州', '80', '健康', '杭州', '上海', '2020-12-16 11:21:54', 't3c68o5s', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('华东师范大学', '大二', '117班', '\\n11010119900307563X', '2003', '城市', '1978', '女', '汉', '党员', '苏州', '81', '良好', '苏州', '浙江', '2020-12-16 11:21:54', 'u2kmul6n', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('武汉大学', '大三', '118班', null, '2004', '农村', '1981', '男', '汉', '党员', '无锡', '82', '感冒', '无锡', '湖南', '2020-12-16 11:21:54', 'z2yo89la', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('西安电子科技', '大四', '119班', '\\n110101199003077993', '2005', '城市', '1982', '女', '汉', '党员', '深圳', '83', '虚弱', '深圳', '广东', '2020-12-16 11:21:54', '36w48gk6', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('华东政法', '大一', '115班', '\\n110101199003079411', '2001', '农村', '1983', '男', '汉', '党员', '长沙', '85', '健康', '长沙', '福建', '2020-12-16 11:21:54', 'pzxahnkd', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('武汉大学', '大二', '116班', '\\n110101199003074258', '2002', '城市', '1984', '女', '汉', '党员', '厦门', '78', '良好', '厦门', '上海', '2020-12-16 11:21:54', '8hybvj0a', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('上海复旦', '大三', '117班', '\\n110101199003073634', '2003', '农村', '1979', '男', '汉', '党员', '上海', '79', '感冒', '上海', '浙江', '2020-12-16 11:21:54', 's4j9e4j9', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('上海交大', '大四', '118班', '\\n110101199003072973', '2004', '城市', '1978', '女', '汉', '党员', '杭州', '80', '虚弱', '杭州', '湖南', '2020-12-16 11:21:54', 'qp12230v', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('同济大学', '大一', '119班', '\\n110101199003073896', '2005', '农村', '1981', '男', '汉', '党员', '苏州', '81', '健康', '苏州', '广东', '2020-12-16 11:21:54', 'zuzbtk9j', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('中国科技大学', '大二', '115班', '\\n110101199003074397', '2001', '城市', '1982', '女', '汉', '党员', '无锡', '82', '良好', '无锡', '福建', '2020-12-16 11:21:54', 'gs5iegrs', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('福州大学', '大三', '116班', '\\n110101199003072375', '2002', '农村', '1983', '男', '汉', '党员', '深圳', '83', '感冒', '深圳', '上海', '2020-12-16 11:21:54', '2z2l09pv', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('上海中医药大', '大四', '117班', null, '2003', '城市', '1984', '女', '汉', '党员', '长沙', '85', '虚弱', '长沙', '浙江', '2020-12-16 11:21:54', 'icig58dg', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('上海大学', '大一', '118班', '\\n110101199003077010', '2004', '农村', '1979', '男', '汉', '党员', '厦门', '78', '健康', '厦门', '湖南', '2020-12-16 11:21:54', 'odglbo6h', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('上海财经大学', '大二', '119班', '\\n110101199003074952', '2005', '城市', '1978', '女', '汉', '党员', '上海', '79', '良好', '上海', '广东', '2020-12-16 11:21:54', 'pjkmp4ol', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('清华大学', '大三', '115班', '\\n110101199003070994', '2001', '农村', '1981', '男', '汉', '党员', '杭州', '80', '感冒', '杭州', '福建', '2020-12-16 11:21:54', '6hhtwsdv', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('北京大学', '大四', '116班', '\\n110101199003077379', '2002', '城市', '1982', '女', '汉', '党员', '苏州', '81', '虚弱', '苏州', '上海', '2020-12-16 11:21:54', 'iljuzmeh', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('浙江大学', '大一', '117班', '\\n110101199003072252', '2003', '农村', '1983', '男', '汉', '党员', '无锡', '82', '健康', '无锡', '浙江', '2020-12-16 11:21:54', 'd5xthari', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('武汉大学', '大二', '118班', '\\n110101199003073351', '2004', '城市', '1984', '女', '汉', '党员', '深圳', '83', '良好', '深圳', '湖南', '2020-12-16 11:21:54', 'hj26j67g', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('北航大学', '大三', '119班', '\\n110101199003071559', '2005', '农村', '1979', '男', '汉', '党员', '长沙', '85', '感冒', '长沙', '广东', '2020-12-16 11:21:54', '83of0fyy', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('华东政法', '大四', '115班', '\\n11010119900307715X', '2001', '城市', '1978', '女', '汉', '党员', '厦门', '78', '虚弱', '厦门', '福建', '2020-12-16 11:21:54', 'jruosx9d', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('武汉大学', '大一', '116班', null, '2002', '农村', '1981', '男', '汉', '党员', '上海', '79', '健康', '上海', '上海', '2020-12-16 11:21:54', 'ozkhusd1', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('上海复旦', '大二', '117班', '\\n110101199003076114', '2003', '城市', '1982', '女', '汉', '党员', '杭州', '80', '良好', '杭州', '浙江', '2020-12-16 11:21:54', 'bdiwp5xb', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('上海交大', '大三', '118班', '\\n110101199003078398', '2004', '农村', '1983', '男', '汉', '党员', '苏州', '81', '感冒', '苏州', '湖南', '2020-12-16 11:21:54', 'sdqum8wm', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('同济大学', '大四', '119班', '\\n110101199003074274', '2005', '城市', '1984', '女', '汉', '党员', '无锡', '82', '虚弱', '无锡', '广东', '2020-12-16 11:21:54', '9weq1t9o', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('华东师范大学', '大一', '115班', '\\n110101199003078910', '2001', '农村', '1979', '男', '汉', '党员', '深圳', '83', '健康', '深圳', '福建', '2020-12-16 11:21:54', '7zxpqoi1', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('华东理工大学', '大二', '116班', '\\n110101199003076472', '2002', '城市', '1978', '女', '汉', '党员', '长沙', '85', '良好', '长沙', '上海', '2020-12-16 11:21:54', 'cqvpfxti', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('上海中医药大', '大三', '117班', '\\n110101199003073933', '2003', '农村', '1981', '男', '汉', '党员', '厦门', '78', '感冒', '厦门', '浙江', '2020-12-16 11:21:54', 'zrpzmjlc', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('上海大学', '大四', '118班', '\\n110101199003077336', '2004', '城市', '1982', '女', '汉', '党员', '上海', '79', '虚弱', '上海', '湖南', '2020-12-16 11:21:54', '2njqiuzi', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('上海财经大学', '大一', '119班', '\\n110101199003079235', '2005', '农村', '1983', '男', '汉', '党员', '杭州', '80', '健康', '杭州', '广东', '2020-12-16 11:21:54', 'swszha7w', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('清华大学', '大二', '115班', null, '2001', '城市', '1984', '女', '汉', '党员', '苏州', '81', '良好', '苏州', '福建', '2020-12-16 11:21:54', '37t4d2zq', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('北京大学', '大三', '116班', '\\n110101199003072957', '2002', '农村', '1979', '男', '汉', '党员', '无锡', '82', '感冒', '无锡', '上海', '2020-12-16 11:21:54', 't5qeoux4', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('浙江大学', '大四', '117班', '\\n110101199003077731', '2003', '城市', '1978', '女', '汉', '党员', '深圳', '83', '虚弱', '深圳', '浙江', '2020-12-16 11:21:54', 'i5nvrys1', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('武汉大学', '大一', '118班', '\\n110101199003074493', '2004', '农村', '1981', '男', '汉', '党员', '长沙', '85', '健康', '长沙', '湖南', '2020-12-16 11:21:54', '3q2ywn0j', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('西安电子科技', '大二', '119班', '\\n11010119900307133X', '2005', '城市', '1982', '女', '汉', '党员', '厦门', '78', '良好', '厦门', '广东', '2020-12-16 11:21:54', 'fa8o6b9c', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('西南政法大学', '大三', '115班', '\\n110101199003075736', '2001', '农村', '1983', '男', '汉', '党员', '上海', '79', '感冒', '上海', '福建', '2020-12-16 11:21:54', '0hfvrj8q', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('武汉大学', '大四', '116班', '\\n110101199003073917', '2002', '城市', '1984', '女', '汉', '党员', '杭州', '80', '虚弱', '杭州', '上海', '2020-12-16 11:21:54', '23ahddg8', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('上海复旦', '大一', '117班', '\\n110101199003075576', '2003', '农村', '1979', '男', '汉', '党员', '苏州', '81', '健康', '苏州', '浙江', '2020-12-16 11:21:54', 'g2ax16wr', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('上海交大', '大二', '118班', '\\n110101199003079358', '2004', '城市', '1978', '女', '汉', '党员', '无锡', '82', '良好', '无锡', '湖南', '2020-12-16 11:21:54', 'xowpclzd', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('同济大学', '大三', '119班', null, '2005', '农村', '1981', '男', '汉', '党员', '深圳', '83', '感冒', '深圳', '广东', '2020-12-16 11:21:54', 'ynwlar5v', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('华东师范大学', '大四', '115班', '\\n110101199003079454', '2001', '城市', '1982', '女', '汉', '党员', '长沙', '85', '虚弱', '长沙', '福建', '2020-12-16 11:21:54', '5p9zjoxd', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('华东理工大学', '大一', '116班', '\\n110101199003073757', '2002', '农村', '1983', '男', '汉', '党员', '厦门', '78', '健康', '厦门', '上海', '2020-12-16 11:21:54', 'ni1nexwq', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('上海中医药大', '大二', '117班', '\\n110101199003079235', '2003', '城市', '1984', '女', '汉', '党员', '上海', '79', '良好', '上海', '浙江', '2020-12-16 11:21:54', '72pifq3m', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('上海大学', '大三', '118班', '\\n110101199003071735', '2004', '农村', '1979', '男', '汉', '党员', '杭州', '80', '感冒', '杭州', '湖南', '2020-12-16 11:21:54', 'kyou94hh', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('上海财经大学', '大四', '119班', '\\n110101199003070759', '2005', '城市', '1978', '女', '汉', '党员', '苏州', '81', '虚弱', '苏州', '广东', '2020-12-16 11:21:54', 'fox3rv79', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('清华大学', '大一', '115班', '\\n110101199003074194', '2001', '农村', '1981', '男', '汉', '党员', '无锡', '82', '健康', '无锡', '福建', '2020-12-16 11:21:54', '7z7a25mc', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('北京大学', '大二', '116班', '\\n110101199003072711', '2002', '城市', '1982', '女', '汉', '党员', '深圳', '83', '良好', '深圳', '上海', '2020-12-16 11:21:54', 'gsb8fymx', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('浙江大学', '大三', '120班', '\\n11010119900307811X', '2003', '农村', '1983', '男', '汉', '党员', '长沙', '85', '感冒', '长沙', '浙江', '2020-12-16 11:21:54', '3gh64nh0', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('武汉大学', '大四', '118班', null, '2004', '城市', '1984', '女', '汉', '党员', '厦门', '78', '虚弱', '厦门', '湖南', '2020-12-16 11:21:54', 'okynwtom', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('华东政法大学', '大一', '119班', '\\n110101199003076050', '2005', '农村', '1979', '男', '汉', '党员', '上海', '79', '健康', '上海', '广东', '2020-12-16 11:21:54', 'npsob2dc', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('华东政法', '大二', '115班', '\\n110101199003079673', '2001', '城市', '1978', '女', '汉', '党员', '杭州', '80', '良好', '杭州', '福建', '2020-12-16 11:21:54', 'pmh1lyii', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('香港大学', '大三', '116班', '\\n110101199003073570', '2002', '农村', '1981', '男', '汉', '党员', '苏州', '81', '感冒', '苏州', '上海', '2020-12-16 11:21:54', 'mzftuv1b', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('上海复旦', '大四', '117班', '\\n110101199003079913', '2003', '城市', '1982', '女', '汉', '党员', '无锡', '82', '虚弱', '无锡', '浙江', '2020-12-16 11:21:54', 'yzb5x87z', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('上理工大学', '大一', '118班', '\\n110101199003075779', '2004', '农村', '1983', '男', '汉', '党员', '深圳', '83', '健康', '深圳', '湖南', '2020-12-16 11:21:54', 'hpoeu5mr', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('同济大学', '大二', '119班', '\\n110101199003071997', '2005', '城市', '1984', '女', '汉', '党员', '长沙', '85', '良好', '长沙', '广东', '2020-12-16 11:21:54', 'd48jeupy', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('华东师范大学', '大三', '115班', '\\n110101199003074194', '2001', '农村', '1979', '男', '汉', '党员', '厦门', '78', '感冒', '厦门', '福建', '2020-12-16 11:21:54', '04rftoh1', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('华东理工大学', '大四', '116班', '\\n110101199003074696', '2002', '城市', '1978', '女', '汉', '党员', '上海', '79', '虚弱', '上海', '上海', '2020-12-16 11:21:54', 'y9di0jgp', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('上海中医药大', '大一', '117班', null, '2003', '农村', '1981', '男', '汉', '党员', '杭州', '80', '健康', '杭州', '浙江', '2020-12-16 11:21:54', '22scpq0v', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('上海大学', '大二', '118班', '\\n11010119900302811X', '2004', '城市', '1982', '女', '汉', '党员', '苏州', '81', '良好', '苏州', '湖南', '2020-12-16 11:21:54', 'izjmcrel', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('上海财经大学', '大三', '119班', '\\n110101199003072033', '2005', '农村', '1983', '男', '汉', '党员', '无锡', '82', '感冒', '无锡', '广东', '2020-12-16 11:21:54', '8ajkyupm', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('清华大学', '大四', '115班', '\\n110101199003077694', '2001', '城市', '1984', '女', '汉', '党员', '深圳', '83', '虚弱', '深圳', '福建', '2020-12-16 11:21:54', 'satymjtj', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('北京大学', '大一', '116班', '\\n110101199003076958', '2002', '农村', '1979', '男', '汉', '党员', '长沙', '85', '健康', '长沙', '上海', '2020-12-16 11:21:54', '4gljur39', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('浙江大学', '大二', '117班', '\\n110101199003074979', '2003', '城市', '1978', '女', '汉', '党员', '厦门', '78', '良好', '厦门', '浙江', '2020-12-16 11:21:54', 'zcmjjsuk', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('武汉大学', '大三', '118班', '\\n110101199003075410', '2004', '农村', '1981', '男', '汉', '党员', '上海', '79', '感冒', '上海', '湖南', '2020-12-16 11:21:54', 'yj9p3tu5', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('福州大学', '大四', '119班', '\\n110101199003071452', '2005', '城市', '1982', '女', '汉', '党员', '杭州', '80', '虚弱', '杭州', '广东', '2020-12-16 11:21:54', 'i42nfxdh', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('北航大学', '大一', '115班', '\\n110101199003076296', '2001', '农村', '1983', '男', '汉', '党员', '苏州', '81', '健康', '苏州', '福建', '2020-12-16 11:21:54', 'gxmb1mw1', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('武汉大学', '大二', '116班', null, '2002', '城市', '1984', '女', '汉', '党员', '无锡', '82', '良好', '无锡', '上海', '2020-12-16 11:21:54', 'cy426zo2', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('上海复旦', '大三', '117班', '\\n110101199003075357', '2003', '农村', '1979', '男', '汉', '党员', '深圳', '83', '感冒', '深圳', '浙江', '2020-12-16 11:21:54', '3px5pau7', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('华东政法大学', '大四', '119班', '\\n110101199003074899', '2005', '农村', '1981', '男', '汉', '党员', '厦门', '78', '健康', '厦门', '广东', '2020-12-16 11:21:54', 'g4y2fyvw', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('华东师范大学', '大二', '115班', '\\n110101199003072295', '2001', '城市', '1982', '女', '汉', '党员', '上海', '79', '良好', '上海', '福建', '2020-12-16 11:21:54', 'bev85v1v', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('中山大学', '大三', '116班', '\\n110101199003072770', '2002', '农村', '1983', '男', '汉', '党员', '杭州', '80', '感冒', '杭州', '上海', '2020-12-16 11:21:54', 'p6h6jwf1', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('上海中医药大', '大四', '117班', '\\n110101199003076456', '2003', '城市', '1984', '女', '汉', '党员', '苏州', '81', '虚弱', '苏州', '浙江', '2020-12-16 11:21:54', '8fbuftrd', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('上海大学', '大一', '118班', '\\n110101199003077731', '2004', '农村', '1979', '男', '汉', '党员', '无锡', '82', '健康', '无锡', '湖南', '2020-12-16 11:21:54', 'rjemiwz3', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('上海财经大学', '大二', '119班', '\\n110101199003071014', '2005', '城市', '1978', '女', '汉', '党员', '深圳', '83', '良好', '深圳', '广东', '2020-12-16 11:21:54', '4owrj465', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('清华大学', '大三', '115班', null, '2001', '农村', '1981', '男', '汉', '党员', '长沙', '85', '感冒', '长沙', '福建', '2020-12-16 11:21:54', 'c33b10m8', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('北京大学', '大四', '116班', '\\n110101199003078638', '2002', '城市', '1982', '女', '汉', '党员', '厦门', '78', '虚弱', '厦门', '上海', '2020-12-16 11:21:54', 'tdkpe9l6', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('浙江大学', '大一', '117班', '110101199003071719', '2003', '农村', '1983', '男', '汉', '党员', '上海', '79', '健康', '上海', '浙江', '2020-12-16 11:21:54', 'e5gvln50', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('武汉大学', '大二', '118班', '\\n110101199003077299', '2004', '城市', '1984', '女', '汉', '党员', '杭州', '80', '良好', '杭州', '湖南', '2020-12-16 11:21:54', '0n612mto', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('西安电子科技', '大三', '119班', '\\n110101199003072391', '2005', '农村', '1979', '男', '汉', '党员', '苏州', '81', '感冒', '苏州', '广东', '2020-12-16 11:21:54', 'qyg73lll', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('华东政法', '大四', null, '\\n110101199003074178', '2001', '城市', '1978', '女', '汉', '党员', '无锡', '82', '虚弱', '无锡', '福建', '2020-12-16 11:21:54', 'wiwjrbz6', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('武汉大学', '大一', null, '\\n11010119900307491X', '2002', '农村', '1981', '男', '汉', '党员', '深圳', '83', '健康', '深圳', '上海', '2020-12-16 11:21:54', 'db2de9bf', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('上海复旦', '大二', null, '\\n11010119900307053X', '2003', '城市', '1982', '女', '汉', '党员', '长沙', '85', '良好', '长沙', '浙江', '2020-12-16 11:21:54', 'rlg9ky3f', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('上海交大', '大三', null, '\\n110101199003074557', '2004', '农村', '1983', '男', '汉', '党员', '厦门', '78', '感冒', '厦门', '湖南', '2020-12-16 11:21:54', '9gxm40c0', '政府');\n" +
                "INSERT INTO `shsjyj_jyxj` VALUES ('同济大学', '大四', null, null, '2005', '城市', '1984', '女', '汉', '党员', '上海', '79', '虚弱', '上海', '广东', '2020-12-16 11:21:54', '5e9mug4b', '政府');\n";
        String[] split = str.split(";");
        String[] strings = generatorPeopleName();
        int i = 0;
        String[] res = new String[100];
        for (String str1 : split) {
            if (i == 100) {
                break;
            }
            String replace = str1.replace("'政府'", "'政府'," + "'" + strings[i] + "'");
            res[i] = replace;
            i++;
        }
        String join = String.join(";", res);
        System.out.println(join);
    }
}
